{"format": "graph-model", "generatedBy": "2.12.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_1": {"name": "input_1:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "51"}]}}}, "outputs": {"dense_2": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "2"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_2/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_2/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_2/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_3/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_3/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_3/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm/norm/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_6/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_4/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_4/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_4/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_5/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_5/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_5/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.expand_dims_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_1/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_1/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_1/Mul/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.expand_dims/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.floor_div/FloorDiv/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.floor_div_1/FloorDiv/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo/shape/1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo/shape/2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_6/GatherV2/indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_6/GatherV2/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/Sum/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.reduce_max/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/flatten/Const", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "34"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "input_1", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "51"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/reshape/Shape", "op": "Shape", "input": ["input_1"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/reshape/Shape", "StatefulPartitionedCall/model/reshape/strided_slice/stack", "StatefulPartitionedCall/model/reshape/strided_slice/stack_1", "StatefulPartitionedCall/model/reshape/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "1"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "0"}, "end_mask": {"i": "0"}, "T": {"type": "DT_INT32"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model/reshape/strided_slice", "StatefulPartitionedCall/model/reshape/Reshape/shape/1", "StatefulPartitionedCall/model/reshape/Reshape/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/reshape/Reshape", "op": "Reshape", "input": ["input_1", "StatefulPartitionedCall/model/reshape/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/model/reshape/Reshape", "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack", "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_1", "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "new_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "begin_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "end_mask": {"i": "3"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice", "StatefulPartitionedCall/model/tf.compat.v1.gather/GatherV2/indices", "StatefulPartitionedCall/model/tf.compat.v1.gather/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_1/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice", "StatefulPartitionedCall/model/tf.compat.v1.gather_1/GatherV2/indices", "StatefulPartitionedCall/model/tf.compat.v1.gather_1/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.size/Size", "op": "Size", "input": ["StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/tf.compat.v1.gather/GatherV2", "StatefulPartitionedCall/model/tf.math.multiply/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/tf.compat.v1.gather_1/GatherV2", "StatefulPartitionedCall/model/tf.math.multiply_1/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.floor_div/FloorDiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/model/tf.compat.v1.size/Size", "StatefulPartitionedCall/model/tf.compat.v1.floor_div/FloorDiv/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.__operators__.add/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model/tf.math.multiply/Mul", "StatefulPartitionedCall/model/tf.math.multiply_1/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model/tf.compat.v1.floor_div/FloorDiv", "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo/shape/1", "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.expand_dims/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/tf.__operators__.add/AddV2", "StatefulPartitionedCall/model/tf.expand_dims/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/model/tf.expand_dims/ExpandDims", "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo/shape"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.math.subtract/Sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice", "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_2/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/tf.math.subtract/Sub", "StatefulPartitionedCall/model/tf.compat.v1.gather_2/GatherV2/indices", "StatefulPartitionedCall/model/tf.compat.v1.gather_2/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_3/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/tf.math.subtract/Sub", "StatefulPartitionedCall/model/tf.compat.v1.gather_3/GatherV2/indices", "StatefulPartitionedCall/model/tf.compat.v1.gather_3/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_4/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/tf.math.subtract/Sub", "StatefulPartitionedCall/model/tf.compat.v1.gather_4/GatherV2/indices", "StatefulPartitionedCall/model/tf.compat.v1.gather_4/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_5/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/tf.math.subtract/Sub", "StatefulPartitionedCall/model/tf.compat.v1.gather_5/GatherV2/indices", "StatefulPartitionedCall/model/tf.compat.v1.gather_5/GatherV2/axis"], "attr": {"Tparams": {"type": "DT_FLOAT"}, "Taxis": {"type": "DT_INT32"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.size_1/Size", "op": "Size", "input": ["StatefulPartitionedCall/model/tf.math.subtract/Sub"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_2/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/tf.compat.v1.gather_2/GatherV2", "StatefulPartitionedCall/model/tf.math.multiply_2/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_3/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/tf.compat.v1.gather_3/GatherV2", "StatefulPartitionedCall/model/tf.math.multiply_3/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_4/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/tf.compat.v1.gather_4/GatherV2", "StatefulPartitionedCall/model/tf.math.multiply_4/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_5/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/tf.compat.v1.gather_5/GatherV2", "StatefulPartitionedCall/model/tf.math.multiply_5/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.floor_div_1/FloorDiv", "op": "FloorDiv", "input": ["StatefulPartitionedCall/model/tf.compat.v1.size_1/Size", "StatefulPartitionedCall/model/tf.compat.v1.floor_div_1/FloorDiv/y"], "attr": {"T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.__operators__.add_1/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model/tf.math.multiply_2/Mul", "StatefulPartitionedCall/model/tf.math.multiply_3/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.__operators__.add_2/AddV2", "op": "AddV2", "input": ["StatefulPartitionedCall/model/tf.math.multiply_4/Mul", "StatefulPartitionedCall/model/tf.math.multiply_5/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo/shape", "op": "Pack", "input": ["StatefulPartitionedCall/model/tf.compat.v1.floor_div_1/FloorDiv", "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo/shape/1", "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo/shape/2"], "attr": {"N": {"i": "3"}, "axis": {"i": "0"}, "T": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/tf.math.subtract_1/Sub", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/model/tf.__operators__.add_1/AddV2", "StatefulPartitionedCall/model/tf.__operators__.add_2/AddV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.expand_dims_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/model/tf.__operators__.add_2/AddV2", "StatefulPartitionedCall/model/tf.expand_dims_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm/norm/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model/tf.math.subtract_1/Sub", "StatefulPartitionedCall/model/tf.compat.v1.norm/norm/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo", "op": "BroadcastTo", "input": ["StatefulPartitionedCall/model/tf.expand_dims_1/ExpandDims", "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo/shape"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm/norm/Sqrt", "op": "Sqrt", "input": ["StatefulPartitionedCall/model/tf.compat.v1.norm/norm/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.math.subtract_2/Sub", "op": "Sub", "input": ["StatefulPartitionedCall/model/tf.math.subtract/Sub", "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm/norm/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/tf.compat.v1.norm/norm/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {}}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_6/GatherV2", "op": "GatherV2", "input": ["StatefulPartitionedCall/model/tf.math.subtract_2/Sub", "StatefulPartitionedCall/model/tf.compat.v1.gather_6/GatherV2/indices", "StatefulPartitionedCall/model/tf.compat.v1.gather_6/GatherV2/axis"], "attr": {"Taxis": {"type": "DT_INT32"}, "Tparams": {"type": "DT_FLOAT"}, "Tindices": {"type": "DT_INT32"}, "batch_dims": {"i": "0"}}}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_6/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/model/tf.compat.v1.norm/norm/Squeeze", "StatefulPartitionedCall/model/tf.math.multiply_6/Mul/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "op": "Square", "input": ["StatefulPartitionedCall/model/tf.compat.v1.gather_6/GatherV2"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/Sum", "op": "Sum", "input": ["StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/ArithmeticOptimizer/ReplaceMulWithSquare_mul", "StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/Sum/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/Sqrt", "op": "Sqrt", "input": ["StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/Sum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/Sqrt"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["0"]}}}}, {"name": "StatefulPartitionedCall/model/tf.math.reduce_max/Max", "op": "Max", "input": ["StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/Squeeze", "StatefulPartitionedCall/model/tf.math.reduce_max/Const"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": false}}}, {"name": "StatefulPartitionedCall/model/tf.math.maximum/Maximum", "op": "Maximum", "input": ["StatefulPartitionedCall/model/tf.math.multiply_6/Mul", "StatefulPartitionedCall/model/tf.math.reduce_max/Max"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/tf.math.truediv/truediv", "op": "RealDiv", "input": ["StatefulPartitionedCall/model/tf.math.subtract/Sub", "StatefulPartitionedCall/model/tf.math.maximum/Maximum"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/flatten/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/model/tf.math.truediv/truediv", "StatefulPartitionedCall/model/flatten/Const"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/model/dense/Relu6", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/flatten/Reshape", "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_1/Relu6", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense/Relu6", "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdTY="]}}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/model/dense_1/Relu6", "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"transpose_a": {"b": false}, "transpose_b": {"b": false}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "leakyrelu_alpha": {"f": 0.2}, "num_args": {"i": "1"}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/model/dense_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/model/dense_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/model/dense_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 1395}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_2/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_2/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_2/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_3/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_3/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_3/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm/norm/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_6/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_4/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_4/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_4/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_5/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_5/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_5/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/tf.expand_dims_1/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.math.multiply/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_1/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_1/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.math.multiply_1/Mul/y", "shape": [], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/tf.expand_dims/ExpandDims/dim", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/reshape/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/reshape/Reshape/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_1", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.__operators__.getitem_1/strided_slice/stack_2", "shape": [3], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.floor_div/FloorDiv/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to/BroadcastTo/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.floor_div_1/FloorDiv/y", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.broadcast_to_1/BroadcastTo/shape/2", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_6/GatherV2/indices", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.gather_6/GatherV2/axis", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.compat.v1.norm_1/norm/Sum/reduction_indices", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/tf.math.reduce_max/Const", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/flatten/Const", "shape": [2], "dtype": "int32"}, {"name": "StatefulPartitionedCall/model/dense/MatMul/ReadVariableOp", "shape": [34, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_1/MatMul/ReadVariableOp", "shape": [128, 64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_1/BiasAdd/ReadVariableOp", "shape": [64], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_2/MatMul/ReadVariableOp", "shape": [64, 2], "dtype": "float32"}, {"name": "StatefulPartitionedCall/model/dense_2/BiasAdd/ReadVariableOp", "shape": [2], "dtype": "float32"}]}]}